# import 宣言

# ストリームハンドラの設定とファイルハンドラの設定

# ファイルハンドラの設定
  
# ログレベルの設定とハンドラの関連づけ

# Logger名の指定

# main 

  # Excel ファイルを指定する
  
  # Excel ファイルのシートリストを取得する

  # sheet の枚数分繰り返す

    # 処理するシートの取得
  
    # インストールパッケージリストの取得

    # 起動/有効化サービスリストの取得

    # セキュリティファイアウォール(インバウンド許可リスト)の取得

    # 追加ユーザリストの取得

    # 追加ユーザリストのコメント取得

    # yaml 変換用複合ユーザリストの作成

 
    # yaml 出力データの整形

    # 出力ファイルの指定

    # YAML へ変換
    
    # 各シートの情報を yaml に変換して出力

    # yaml出力内容の出力
  # man() 正常終了

# シートリストの取得関数

  # シートリストの処理

# call main Function